eerimoq/simba/make/arduino/esp32/boards.txt
#
# @section License
#
# The MIT License (MIT)
#
# Copyright (c) 2014-2016, Erik Moqvist
#
# Permission is hereby granted, free of charge, to any person
# obtaining a copy of this software and associated documentation
# files (the "Software"), to deal in the Software without
# restriction, including without limitation the rights to use, copy,
# modify, merge, publish, distribute, sublicense, and/or sell copies
# of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be
# included in all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
# NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
# BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
# ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
# CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.
#
# This file is part of the Simba project.
#
##################################################################

nano32.name=Nano32

nano32.upload.tool=esptool
nano32.upload.speed=115200
nano32.upload.resetmethod=ck
nano32.upload.maximum_size=2000000
nano32.upload.maximum_data_size=294912
nano32.upload.wait_for_upload_port=true
nano32.serial.disableDTR=true
nano32.serial.disableRTS=true

nano32.build.mcu=esp32
nano32.build.f_cpu=240000000L
nano32.build.board=Nano32
nano32.build.variant=nano32
nano32.build.core=Simba:simba
nano32.build.ldscript=simba.flash.ld
nano32.build.flash_size=4M
nano32.build.flash_mode=dio
nano32.build.flash_freq=40

nano32.compiler.c.extra_flags={nano32_compiler_c_extra_flags}
nano32.compiler.cpp.extra_flags={nano32_compiler_cxx_extra_flags}
nano32.compiler.S.extra_flags={nano32_compiler_c_extra_flags}
nano32.compiler.c.elf.extra_flags={nano32_compiler_c_elf_extra_flags}
nano32.compiler.c.elf.libs={nano32_compiler_c_elf_libs}

##################################################################

esp32_devkitc.name=ESP32-DevKitC

esp32_devkitc.upload.tool=esptool
esp32_devkitc.upload.speed=115200
esp32_devkitc.upload.resetmethod=ck
esp32_devkitc.upload.maximum_size=2000000
esp32_devkitc.upload.maximum_data_size=294912
esp32_devkitc.upload.wait_for_upload_port=true
esp32_devkitc.serial.disableDTR=true
esp32_devkitc.serial.disableRTS=true

esp32_devkitc.build.mcu=esp32
esp32_devkitc.build.f_cpu=240000000L
esp32_devkitc.build.board=Esp32_Devkitc
esp32_devkitc.build.variant=esp32_devkitc
esp32_devkitc.build.core=Simba:simba
esp32_devkitc.build.ldscript=simba.flash.ld
esp32_devkitc.build.flash_size=4M
esp32_devkitc.build.flash_mode=dio
esp32_devkitc.build.flash_freq=40

esp32_devkitc.compiler.c.extra_flags={esp32_devkitc_compiler_c_extra_flags}
esp32_devkitc.compiler.cpp.extra_flags={esp32_devkitc_compiler_cxx_extra_flags}
esp32_devkitc.compiler.S.extra_flags={esp32_devkitc_compiler_c_extra_flags}
esp32_devkitc.compiler.c.elf.extra_flags={esp32_devkitc_compiler_c_elf_extra_flags}
esp32_devkitc.compiler.c.elf.libs={esp32_devkitc_compiler_c_elf_libs}

##################################################################
